---
kind: method
id: M:Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.ReverseIterator
source: html/68024a1c-b37d-5e71-7ba9-e470fd9ea48f.htm
---
# Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual GroundConductorSizeSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.